#include "DigitalTube6.h"

#ifdef DIGITALTUBE6_CONFIG

/*------------------------------------------------
                    数码管位定义
------------------------------------------------*/
static uchar SMG_Wei[6]   =
{
	0xe8,0xe9,0xea,0xeb,0xec,0xed
};
/*------------------------------------------------
                    数码管段定义
------------------------------------------------*/
static uchar SMG_Duan[16] =
{
	0xc0,0xf9,0xa4,0xb0,
	0x99,0x92,0x82,0xf8,
	0x80,0x90,0x88,0x83,
	0xc6,0xa1,0x86,0x8e
};

/*------------------------------------------------
                 数码管显示延时
------------------------------------------------*/
void SMG_Delay(uchar ms)
{
	uchar i;
	while(ms--)
		for(i=0;i<110;i++);
}

/*------------------------------------------------
                 数码管显示函数
------------------------------------------------*/
void SMG_Show(uchar x,uchar dat)
{
	SMG_WEI  = SMG_Wei[x];
	SMG_DUAN = SMG_Duan[dat];
	SMG_Delay(2);
}

#endif /* DIGITALTUBE6_CONFIG */
