/***********************************************************************************************************************
 *                                                      ESourceOpen
 *                                           -----------------------------------
 *                                           explore and open  embedded platform
 * 
 * Contact information:
 * e-mail: 1786409879@qq.com / txh17778443952@169.com
 *                                                                                 +-------------+---------------------+
 * ESourceOpen：                                                                   |   founder   |       TXHopen       |
 *   The ESource plan is a difficult and long-term plan. This plan                 +-------------+---------------------+
 *   does not limit the use of code, only to provide an open platform              |   encode    |    UTF-8 / utf-8    |
 *   to explore the software development of embedded platforms.                    +-------------+---------------------+
***********************************************************************************************************************/
/**
 * *****************************************************ESourceOPEN*****************************************************
 * @file      ad9850.h
 * 
 * @brief     片外驱动：ad9850模块驱动头文件
 * 
 * @version   V0.00.01
 * 
 * @author    TXHopen (3332695529@qq.com)
 * 
 * @date      2021-08-08
 * 
 * @copyright Copyright (c) 2021
 * 
 * *****************************************************ESourceOPEN*****************************************************
 * 
 * *****************************************************ESourceOPEN*****************************************************
 **/
#ifndef __AD9850_H
#define __AD9850_H


#include "user_config_prj.h"

#ifdef AD9850_CONFIG

#include "es_sys_package.h"
/* ------------------------------------------------------------------------------------------------------------------ */
sbit    AD9850_DATA       = P3^1;
sbit    AD9850_UD         = P3^2;
sbit    AD9850_CLK        = P3^3;
sbit    AD9850_REST       = P3^0;

/* ------------------------------------------------------------------------------------------------------------------ */
void ad9850_reset_serial();
void ad9850_wr_serial(unsigned char w0,double frequence);

/* ------------------------------------------------------------------------------------------------------------------ */
#endif /* AD9850_CONFIG */

#endif /* __AD9850_H */

